import random


# 任务队列长度，0为不限制（注意过短的列队可能造成任务阻塞，无法继续执行，列队长度最好1000以上）
Q_TASK_SIZE = 0  # 下载任务列队
Q_STORAGE_SIZE = 0  # 待存储任务列队
Q_REAULT_SIZE = 0  # 中间任务列队


# 各任务线程数
D_THREAD_NUM = 2  # 下载线程数
R_THREAD_NUM = 1  # 任务处理线程数
S_THREAD_NUM = 1  # 存储线程数


# 日志文件名
LOGFILE_NAME = 'runtimelog.log'


# 数据库配置支持oracle和mysql
WETHER_DB = True
DBNAME = 'oracle'
LINK = {
    'user':'bq_data',
    'password':'tiger', 
    'host':'10.31.155.129:1521/orcl.lan', #内网
    # 'host':'39.107.57.229:1521/orcl.lan',  #外网
}  #链接配置，注意mysql和oracle的配置的不同
TABLE_NAME = 'CRAW_KB_CONTENT'  # 当命令行传参没有数据表名时，默认的数据表名称
DATA_STRUCT = {
    "ID": 'NUMBER NOT NULL',
    "GENDER": 'VARCHAR2(5 CHAR)',
    "CARTYPE": 'VARCHAR2(255 CHAR)',
    "CARVERSION": 'VARCHAR2(255 CHAR)',
    "TIMEBYING": 'DATE',
    "PLACEBYING": 'VARCHAR2(100 CHAR)',
    "PURPOSEBYING": 'VARCHAR2(255 CHAR)',
    "YEARSOLD": 'NUMBER(4)',
    "KJ": 'NUMBER(2)',
    "DL": 'NUMBER(2)',
    "CK": 'NUMBER(2)',
    "YH": 'NUMBER(2)',
    "HD": 'NUMBER(2)',
    "SS": 'NUMBER(2)',
    "WG": 'NUMBER(2)',
    "NS": 'NUMBER(2)',
    "XJB": 'NUMBER(2)',
    "YOUHAO": 'VARCHAR2(10 BYTE)',
    "HAODIAN": 'VARCHAR2(10 BYTE)',
    "CRAWLER_TIME": 'DATE',
    "USERID": 'VARCHAR2(100 BYTE)',
    'PUBLISHTIME': 'DATE',
    'PRICE': 'VARCHAR2(10 CHAR)',
    'CARPORT': 'VARCHAR2(255 CHAR)',
    'DOMICILE': 'VARCHAR2(20 CHAR)',
    'SATISFIED':'VARCHAR2(4000 CHAR)',
    'UNSATISFIED':'VARCHAR2(4000 CHAR)',
    'WHY':'VARCHAR2(4000 CHAR)',
    'SPACE':'VARCHAR2(4000 CHAR)',
    'POWER':'VARCHAR2(4000 CHAR)',
    'CONTROL':'VARCHAR2(4000 CHAR)',
    'COMFORT':'VARCHAR2(4000 CHAR)',
    'APPEARANCE':'VARCHAR2(4000 CHAR)',
    'TRIM':'VARCHAR2(4000 CHAR)',
    'COSTPERF':'VARCHAR2(4000 CHAR)'
}  # 数据库中的数据结构，mysql可以为None（前提是以创建表），oracle是必须的。


# 下载延时，针对单个线程
DELAY = 0
# 下载超时，针对每个下载任务
TIMEOUT = 2


# COOKIE可以是一个字符串用于获取cookie的地址，或者一个cookie的字典
COOKIES = False
COOKIE = {
    'sessionlogin':'20306fce4ed1403ab894f6d4f0b3f0a9058bb878'
}
# https://sso.autohome.com.cn/Home/CookieIFrame get请求，用于更新cookie，这部分在spider中做了。


# 爬虫模块, 所有的爬虫模块都要在此注册
SPIDERS = [
    'spiders.Spider',
    'spiders.InSpider'
    ]


# 任务列队的发布地址和口令，做分布时，不要随机。
TASK_KEY = {
    'addr':'localhost',
    'port':random.randint(8000, 65000),
    'authkey':b'k',
}


# IPPool服务器
WETHER_IPPOLL = False
PROXY_URL = 'http://vip22.xiguadaili.com/ip/?tid=556082430314945&num=1000&category=2&protocol=https'
PROXY = {
    'ip': 'localhost',
    'port': 16000,
    'authkey': 'ippool'
}


# 汽车之家品牌对应的id
BRANDID = {
    'AC Schnitzer': 117,
    'ALPINA': 276,
    '阿尔法·罗密欧': 34,
    '阿斯顿·马丁': 35,
    '安凯客车': 221,
    '奥迪': 33,
    '巴博斯': 140,
    '宝骏': 120,
    '宝马': 15,
    '宝骐汽车': 351,
    '宝沃': 231,
    '保时捷': 40,
    '北京': 27,
    '北汽昌河': 79,
    '北汽道达': 301,
    '北汽幻速': 203,
    '北汽绅宝': 173,
    '北汽威旺': 143,
    '北汽新能源': 208,
    '北汽制造': 154,
    '奔驰': 36,
    '奔腾': 95,
    '本田': 14,
    '比速汽车': 271,
    '比亚迪': 75,
    '标致': 13,
    '别克': 38,
    '宾利': 39,
    '布加迪': 37,
    '长安': 76,
    '长安跨越': 299,
    '长安欧尚': 163,
    '长安轻型车': 294,
    '长城': 77,
    '成功汽车': 196,
    'DS': 169,
    '大乘汽车': 341,
    '大发': 92,
    '大众': 1,
    '道奇': 41,
    '电咖': 280,
    '东风': 32,
    '东风·瑞泰特': 326,
    '东风风度': 187,
    '东风风光': 259,
    '东风风神': 113,
    '东风风行': 165,
    '东风小康': 142,
    '东南': 81,
    '法拉利': 42,
    '菲亚特': 11,
    '丰田': 3,
    '福迪': 141,
    '福汽启腾': 197,
    '福特': 8,
    '福田': 96,
    '福田乘用车': 282,
    'GMC': 112,
    '观致': 152,
    '光冈': 116,
    '广汽传祺': 82,
    '广汽吉奥': 108,
    '广汽集团': 329,
    '广汽新能源': 313,
    '国金汽车': 304,
    '哈飞': 24,
    '哈弗': 181,
    '海格': 150,
    '海马': 86,
    '汉腾汽车': 267,
    '悍马': 43,
    '恒天': 164,
    '红旗': 91,
    '红星汽车': 336,
    '华凯': 245,
    '华利': 237,
    '华普': 85,
    '华骐': 184,
    '华颂': 220,
    '华泰': 87,
    '华泰新能源': 260,
    '黄海': 97,
    'Icona': 188,
    'Jeep': 46,
    '吉利汽车': 25,
    '江淮': 84,
    '江铃': 119,
    '江铃集团轻汽': 210,
    '江铃集团新能源': 270,
    '捷豹': 44,
    '捷途': 319,
    '金杯': 83,
    '金龙': 145,
    '金旅': 175,
    '九龙': 151,
    '君马汽车': 297,
    '钧天': 356,
    'KTM': 109,
    '卡尔森': 156,
    '卡升': 224,
    '卡威': 199,
    '开瑞': 101,
    '凯迪拉克': 47,
    '凯翼': 214,
    '科尼赛克': 100,
    '克莱斯勒': 9,
    'LITE': 335,
    'LOCAL MOTORS': 241,
    'Lorinser': 118,
    '兰博基尼': 48,
    '劳斯莱斯': 54,
    '雷克萨斯': 52,
    '雷诺': 10,
    '理念': 124,
    '力帆汽车': 80,
    '莲花汽车': 89,
    '猎豹汽车': 78,
    '林肯': 51,
    '铃木': 53,
    '零跑汽车': 318,
    '领克': 279,
    '领途汽车': 343,
    '陆地方舟': 204,
    '陆风': 88,
    '路虎': 49,
    '路特斯': 50,
    '罗夫哈特': 346,
    'MINI': 56,
    '马自达': 58,
    '玛莎拉蒂': 57,
    '迈巴赫': 55,
    '迈凯伦': 129,
    '名爵': 20,
    '摩根': 168,
    '哪吒汽车': 334,
    '纳智捷': 130,
    '南京金龙': 213,
    '讴歌': 60,
    '欧宝': 59,
    '欧拉': 331,
    '欧朗': 146,
    '欧尚汽车': 332,
    'Polestar': 308,
    '帕加尼': 61,
    '奇瑞': 26,
    '启辰': 122,
    '起亚': 62,
    '前途': 235,
    '乔治·巴顿': 222,
    '庆铃汽车': 312,
    '全球鹰': 219,
    '日产': 63,
    '荣威': 19,
    '容大智造': 337,
    '如虎': 174,
    '瑞驰新能源': 296,
    '瑞麒': 103,
    'smart': 45,
    'SWM斯威汽车': 269,
    '萨博': 64,
    '赛麟': 205,
    '三菱': 68,
    '陕汽通家': 149,
    '上汽大通': 155,
    '世爵': 66,
    '双环': 90,
    '双龙': 69,
    '思铭': 162,
    '斯巴鲁': 65,
    '斯达泰克': 238,
    '斯柯达': 67,
    '泰卡特': 202,
    '特斯拉': 133,
    '腾势': 161,
    'WEY': 283,
    '威麟': 102,
    '威马汽车': 291,
    '威兹曼': 99,
    '潍柴英致': 192,
    '蔚来': 284,
    '沃尔沃': 70,
    '五菱汽车': 114,
    '五十铃': 167,
    '西雅特': 98,
    '现代': 12,
    '小鹏汽车': 275,
    '新凯': 185,
    '新特汽车': 324,
    '鑫源': 306,
    '雪佛兰': 71,
    '雪铁龙': 72,
    '野马汽车': 111,
    '一汽': 110,
    '依维柯': 144,
    '英菲尼迪': 73,
    '永源': 93,
    '宇通客车': 298,
    '驭胜': 263,
    '御捷': 232,
    '裕路': 307,
    '云度': 286,
    '云雀汽车': 317,
    '之诺': 182,
    '知豆': 206,
    '中华': 22,
    '中兴': 74,
    '众泰': 94
 }

